//좀 더 생각해보기

// // 전제 5 단위로 끊기
// // 5 이하면 그냥 표시

// // length <= 5, 하나씩 찍기
// // 1 2 3 4 5 



// // //length : 8, leftIdx = 1, rightIdx = 1, right만 먼저 출발
// // '1'2345
// // 1'2'345
// // 12'3'45 // 단위가 5가 넘어갈 면, 5/2 올림인 3까지 right만 먼저 출발하고,  length 끝이 보일때까지 left right 한칸씩 이동한다.

// // 23'4'56 // left right 한칸씩 이동, length 끝이 보일때까지
// // 34'5'67
// // 45'6'78 // length 끝이 보이면 right만 length 끝까지 이동
// // 456'7'8
// // 4567'8'
// [1,2,3,4,5,6,7,8,9,10]
// [0,1,2,3,4,5,6,7,8,9]

// function pagiBtn (length) {
//   let cut = 5;
//   let togetherIdx = Math.floor(cut / 2); //2
//   let idxArr = Array(length).fill().map((ele,idx) => idx+1) //[1,2,3,4,5,6,7,8,9,10]
//   let leftIdx = 0

//   if(length <= 5) {
//     for(let i = 0; i < idxArr.length; i++) { //[1,2,3,4,5]
//       let rightIdx = i 
//       '1'2345
//       1'2'345
//       12'3'45
//       123'4'5
//       1234'5'
//     }
//   }
  

//   for(let i = 0; i < idxArr.length; i++) {
//     let rightIdx = 0
//     if(idxArr[rightIdx] <= 3) {

//     }
//   }


// }

// // //length : 9, 
// // '1'2345
// // 1'2'345
// // 12'3'45
// // 23'4'56
// // 34'5'67
// // 45'6'78
// // 56'7'89 // length 끝이 보이면 right만 length 끝까지 이동
// // 567'8'9
// // 5678'9'


// // //length : 12

// // '1'2345
// // 1'2'345
// // 12'3'45
// // 23'4'56
// // 34'5'67
// // 45'6'78
// // 56'7'89
// // 67'8'910
// // 78'9'1011
// // 89'10'1112
// // 8910'11'12
// // 891011'12'


